src/Documents/ВъездНаПарковку/ВъездНаПарковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВъездНаПарковку</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>Авто</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряда</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ВъездНаПарковку/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
	Если Параметры.Свойство("Место") Тогда
		Объект.Место = Параметры.Место;
	КонецЕсли;
	
	Если Параметры.Свойство("Ряд") Тогда
		Объект.Ряд = Параметры.Ряд;
	КонецЕсли;
	
	Дата = ТекущаяДата();

КонецПроцедуры
